/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: widraugr <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2018/11/23 11:12:34 by widraugr          #+#    #+#             */
/*   Updated: 2018/12/04 13:11:09 by widraugr         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"
#include <string.h>

#include <stdio.h>
#include <ctype.h>

int main (void)
{
	
	//Функция isalpha проверяет аргумент, передаваемый через параметр сharacter,
	//является ли он строчной или прописной буквой алфавита.
	int i = 0;
	char a[] = "Hello123-aaf";
	while (a[i])
	{
		printf("ft_isalpha\t%c\t%d\n", a[i], ft_isalpha(a[i]));
		printf("isalpha\t\t%c\t%d\n", a[i], isalpha(a[i]));
		i++;
	}
	
	//	atoi переводит строку в число
	/*char	s1[] = "99999999999999999999";
	printf("%s  %d\n",s1, ft_atoi(s1));	
	printf("%s  %d\n",s1,  atoi(s1));	
	char	s2[] = "-99999999999999999999";
	printf("%s  %d\n",s2, ft_atoi(s2));	
	printf("%s  %d\n",s2,  atoi(s2));	
	char	s3[] = "\e475";
	printf("%s  %d\n",s3, ft_atoi(s3));	
	printf("%s  %d\n",s3,  atoi(s3));	
	*/
    //---------------------------------------------------------------------------
	//ft_strnstr Ищет первое вхождение строки needle в len первыйх байт haystack
	//char	h[] = "MZIRIBMZIRIBMZE123";
	//char	n[] = "MZIRIBMZE";
	//printf("%s\n",ft_strnstr(h, n, strlen(n)));	
	//printf("%s\n",strnstr(h, n, strlen(n)));	
    //---------------------------------------------------------------------------
    //---------------------------------------------------------------------------
	//ft_strstr Ищет первое вхождение строки needle в haystack
	//char	h[100] = "see F your F return FF now FF";
	//char	n[100] = "FF";
	//printf("%s\n",ft_strstr(h, n));	
	//printf("%s\n",strstr(h, n));	
    //---------------------------------------------------------------------------
	//ft_memccpyr Копирует n байт пока невстретит 'c' или не будет достригнут n
	//[1]    28450 abort      ./main
	/*char dst[] = "aeraa";
	char src[] = "12e8";
	int n = 7;
	ft_memccpy(dst, src, 'e',  n);	
	printf("dst = %s, stc = %s\n", dst, src);
	char dst2[] = "aeraa";
	char src2[] = "12e8";
	memccpy(dst2, src2, 'e',  n);	
	printf("dst = %s, stc = %s", dst2, src2);
    */
	//---------------------------------------------------------------------------
	//ft_strncmp сравнивает два массива (области памяти),не превышая len
	//на которые указывают аргументы arr1 и arr2. 
	//Сравнение продолжается, пока не  не встретятся отличающиеся байты.
	// + если s1 > s2; - если s1 < s2
	/*char	s[] = "test\200";
	char	m[] = "test\0";
	int n = 6;
	printf("%d\n", ft_strncmp(s, m, n));	
	printf("%d\n", strncmp(s, m, n));	
	*/
    //---------------------------------------------------------------------------
	//Функция tolower преобразует аргумент, передаваемый через параметр сharacter,
	//в верхний регистр
	//int i = 0;
	//char a[] = " ASFG123sdf %$#*Z";
	//while (a[i])
	//{
	//	printf("ft_tolower\t%c\t%d\n", a[i],ft_tolower(a[i]));
	//	printf("tolower \t%c\t%d\n", a[i],tolower(a[i]));
	//	i++;
	//}
    //---------------------------------------------------------------------------
	//Функция toupper преобразует аргумент, передаваемый через параметр сharacter,
	//в верхний регистр
	/*int i = 0;
	char a[] = " Aelz123%$#*~";
	while (a[i])
	{
		printf("ft_toupper\t%c\t%d\n", a[i], ft_toupper(a[i]));
		printf("toupper \t%c\t%d\n", a[i], toupper(a[i]));
		i++;
	}
	*/	
    //---------------------------------------------------------------------------
	//Функция isprint проверяет аргумент, передаваемый через параметр сharacter,
	//является ли он печатным символом (от 32 до 126)
	/*int i = 0;
	char a[] = " Aelz123%$#*~";
	while (a[i])
	{
		printf("ft_isprin\t%c\t%d\n", a[i], ft_isprint(a[i]));
		printf("isprint \t%c\t%d\n", a[i],isprint(a[i]));
		i++;
	}
	*/	
    //---------------------------------------------------------------------------
	//Функция isascii проверяет аргумент, передаваемый через параметр сharacter,
	//является ли он цифрой или буквой (строчной и прописной)
	/*int i = 0;
	char a[] = "Aelz123%$#*";
	while (a[i])
	{
		printf("ft_isascii\t%c\t%d\n", a[i], ft_isascii(a[i]));
		printf("isascii \t%c\t%d\n", a[i], isascii(a[i]));
		i++;
	}
	*/
    //---------------------------------------------------------------------------
	//Функция isalnum проверяет аргумент, передаваемый через параметр сharacter,
	//является ли он цифрой или буквой (строчной и прописной)
	/*int i = 0;
	char a[] = "Aelz123%$#*";
	while (a[i])
	{
		printf("ft_isalnum\t%c\t%d\n", a[i], ft_isalnum(a[i]));
		printf("isalnum \t%c\t%d\n", a[i], isalnum(a[i]));
		i++;
	}
	*/
	 //---------------------------------------------------------------------------
	//Функция isdigit проверяет аргумент, передаваемый через параметр сharacter,
	//является ли он цифрой
	/*int i = 0;
	char a[] = "Aelz123";
	while (a[i])
	{
		printf("ft_isdigit\t%c\t%d\n", a[i], ft_isdigit(a[i]));
		printf("isdigit\t\t%c\t%d\n", a[i], isdigit(a[i]));
		i++;
	}
	*/
    //---------------------------------------------------------------------------
    //---------------------------------------------------------------------------
	//ft_strncmp сравнивает два массива (области памяти),не превышая len
	//на которые указывают аргументы arr1 и arr2. 
	//Сравнение продолжается, пока не  не встретятся отличающиеся байты.
	// + если s1 > s2; - если s1 < s2
	//char	s[] = "1234a678";
	//char	m[] = "1234a67";
	//int n = 20;
	//printf("%d\n", ft_strncmp(s, m, n));	
	//printf("%d\n", strncmp(s, m, n));	
    //---------------------------------------------------------------------------
	//Функция ft_strcmp сравнивает два массива (области памяти), на которые
	//указывают аргументы arr1 и arr2. 
	//Сравнение продолжается, пока не  не встретятся отличающиеся байты.
	// + если s1 > s2; - если s1 < s2
	//char	s[] = "1234a678";
	//char	m[] = "1p34567";
	//printf("%d\n", ft_strcmp(s, m));	
	//printf("%d\n", strcmp(s, m));	
    //---------------------------------------------------------------------------
	//Функция strrchr находит последнее  вхождение  символа  c  в
	//строке  string. Нулевой символ окончания ('\0') строки string вклю-
	//чается в поиск.
	//char	s[100] = "12223452678";
	//printf("%s\n",ft_strrchr(s,'2'));	
	//printf("%s\n",strrchr(s,'2'));	
    //---------------------------------------------------------------------------
	//ft_strchr Функция strchr выполняет поиск первого вхождения символа symbol в строку
	//string. Возвращает указатель на первое вхождение символа в строке. 
	//Завершающий нулевой символ считается частью Си-строки. Таким образом, 
	//он также может быть найден для получения указателя на конец строки.
	//char	s[100] = "12345 678";
	//printf("%s\n",ft_strchr(s,'d'));	
	//printf("%s\n",strchr(s,'d'));	
	//printf("%s\n",NULL);	
    //---------------------------------------------------------------------------
	//ft_strlcat Функция копирует из строки src в буфер dst не более чем size - 1 символов
	//и гарантированно устанавливает в конец строки нулевой символ.
	//int n = 10;
	//char	s[100] = "12345678";
	//char	m[] = "abcdefg";
	//printf("%zu\n",ft_strlcat(s, m, n));	
	//printf("%s  %s", s ,m);
    //---------------------------------------------------------------------------
	//Функция добавляет первые num символов строки srcptr к концу строки destptr
	//, плюс символ конца строки. функция не производит контроля границ, поэтому 
	//программист дол­жен сам позаботиться о том, чтобы строка str1 была 
	//достаточно длинной и могла вместить помимо своего первоначального содержи
	//мого еще и содержимое строки str2.
	//int n = 100;
	//char	s[100] = "12a4a678";
	//char	m[] = "abcdefg";
	//printf("%s\n", ft_strncat(s, m, n));	
    //---------------------------------------------------------------------------
	//ft_strcat Объединение строк. Функция добавляет копию строки srcptr в конец 
	//строки destptr. Нулевой символ конца строки destptr заменяется первым символом
	//строки srcptr, и новый нуль-символ добавляется в конец уже новой строки, 
	//сформированной объединением символов двух строк в строке destptr.
	//char	s[100] = "12a4a678";
	//char	m[] = "12a4567";
	//printf("%s\n", ft_strcat(s, m));	
    //---------------------------------------------------------------------------
	//Если в аргументе n указана величина большая, чем длинна строки, т.е. символ
	//конца строки '\000' встретился раньше, чем было скопировано n символов, то
	//в массив, на который указывает аргумент destination, дозаписывается столько
	//нулевых символов, чтобы общая длина записанной строки достигла величины 
	//указанной в аргументе n.
	//char src[1024]= "п123456789 строкавторая строка";
	//char dst[10];
	//ft_strncpy (dst, src, 7);
    //printf ("src: %s \n",src);
    //strncpy (dst, src, 1);
	//printf ("src: %s \n",src);
	//printf ("dst: %s \n",dst);
    //---------------------------------------------------------------------------
	//ft_strcpy Функция возвращает указатель на строку, в которую скопированы данные.
	//char src[1024]="первая строка\0вторая строка";
	//char dst[1024];
    //ft_strcpy (dst, src);
    //printf ("src: %s \n",src);
    //printf ("dst: %s \n",dst);
    //---------------------------------------------------------------------------
	//Функция ft_memcmp побайтно сравнивает два массива (области памяти), на которые
	//указывают аргументы arr1 и arr2. Каждый байт массива определяется типом
	//unsigned char. Сравнение продолжается, пока не будут проверено n байт или 
	//пока не встретятся отличающиеся байты. + если s1 > s2; - если s1 < s2
	//char	s[] = "12a4a678";
	//char	m[] = "12a4567";
	//int n = 5;
	//printf("%d\n", ft_memcmp(s, m, n));	
	//	printf("%d\n", b);
    //---------------------------------------------------------------------------
	//Функция ft_memchr в n байтах блока памяти, адресуемого указателем s,
	// ищет первое вхождение с, возвращает указатель на найденный элемет,
	// или NULL
	//char s[] = "12r45678";
	//char	*m;
	//int n = 3;
	//m = ft_memchr(s,'4',  n);	
	//if (m != NULL)
	//	m[0] = '!';
	//else 
	//	s[0] = '&';
	//printf("ptr = %s\n", s);
    //---------------------------------------------------------------------------
	//ft_memmove копирует блок из n байт  из  src  в  dest. Копирование 
	//будет  произведено  корректно, даже, если блоки перекрываются.
	//Копирование происходит через промежуточный буфер????
	//char dst[] = "aeraa";
	//char src[] = "12r45678";
	//int n = 3;
	//ft_memmove(dst, src,  n);	
	//printf("dst = %s, stc = %s\n", dst, src);
	//char dst2[] = "aeraa";
	//char src2[] = "12r45678";
	//memmove(dst2, src2, n);	
	//printf("dst = %s, stc = %s", dst2, src2);
    //---------------------------------------------------------------------------
    //---------------------------------------------------------------------------
	//Копирует содержимоке одной области памяти в другую. (restrict)
	//Не проверяет соответствие размера выходного буфера количеству копируемых байт
	//char dst[] = "98765Hello";
	//char src[] = "llo";
	//int n = 4;
	//ft_memcpy(dst, src,  n);	
	//printf("dst = %s, stc = %s\n", dst, src);
	//memcpy(dst, src,  n);	
	//printf("dst = %s, stc = %s", dst, src);
    //---------------------------------------------------------------------------
	//Устанавливает n \0
	//char s[] = "Hello";
	//char b[] = "Hello";
	//ft_bzero(s, 2);	printf("%s\n", s);
	//bzero(b, 2);	printf("%s\n", b);
    //---------------------------------------------------------------------------
	//char s[] = "Hello";
	//printf("%s\n", ft_memset(s, 'b', 4));
	//printf("%s\n", memset(s, 'a', 4));
	//printf("%s\n", s);
    //---------------------------------------------------------------------------
	//char *s;
	//s = ft_strdup("hello");	
	//printf("%s\n", s);
	//free(s);
	//printf("%s\n", ft_strdup("str"));
	//printf("%s\n", strdup("str"));
    //---------------------------------------------------------------------------
	//printf("%lu\n", ft_strlen("str"));
	//printf("%lu\n", strlen("str"));
	return (0);
}
